app/controllers/indoors_controller.rb

SELECT * FROM `indoors`
---
  def index
    @indoors = Indoor.all

SELECT * FROM `indoors` WHERE (`indoors`.`id` = 1)
---
  def show
    @indoor = Indoor.find(params[:id])

INSERT INTO `indoors` (`updated_at`, `date`, `sales_incharge`, `created_at`) VALUES('2010-12-20 06:14:47', '2010-10-20', 's s dange', '2010-12-20 06:14:47')
---
  def create
    @indoor = Indoor.new(params[:indoor])

    respond_to do |format|
      if @indoor.save