app/controllers/product_masters_controller.rb

  def index
    @product_masters = ProductMaster.all
---
SELECT * FROM `product_masters`

   def show
    @product_master = ProductMaster.find(params[:id])
---
SELECT * FROM `product_masters` WHERE (`product_masters`.`id` = 1)

  def create
    @product_master = ProductMaster.new(params[:product_master])
    respond_to do |format|
      if @product_master.save
---
INSERT INTO `product_masters` (`tax`, `updated_at`, `price`, `date`, `Quntity`, `product_id`, `created_at`) VALUES(20.0, '2010-12-19 06:51:44', 1000.0, '2010-12-19', 30, NULL, '2010-12-19 06:51:44')

  def destroy
    @product_master = ProductMaster.find(params[:id])
    @product_master.destroy
---
SELECT * FROM `product_masters` WHERE (`product_masters`.`id` = 2)
DELETE FROM `product_masters` WHERE `id` = 2