app/controllers/products_controller.rb

   def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`pro_des`, `updated_at`, `product_name`, `created_at`) VALUES('Sugar ', '2010-12-19 06:37:50', 'Suger', '2010-12-19 06:37:50')